



menu = '''Главное меню:
1. Посмотреть все контакты
2. Добавить контакт
3. Найти контакт
4. Изменить контакт
5. Удалить контакт
6. Выход\n'''

input_choice = 'Выберите пункт меню: '

wrong_menu_selection = 'Вы ввели неверное число. Надо от 1 до 8'

data_base_ok = 'База данных телефонной книги создана!'

data_base_fail = 'Ошибка базы данных!'

contact_added = 'Пользователь добавлен'

surname_input = 'Фамилия: '
name_input = 'Имя: '
patronymic_input = 'Отчество: '
phone_input = 'Телефон: '
comment_input = 'Комментарий: '

phone_book_empty = 'В телефонной книге еще нет записей'

find_contact = 'Что ищем: '

nothing_found = 'Упс, ничего не найдено...'

delete_input = 'Кого будем удалять? '

delete_input_id = 'Подтвердите удаление контакты введя его номер позиции '

contact_has_been_deleted = 'Контакт удален'

contact_has_been_updated = 'Контакт изменен'

update_contact_input = 'Введите какой контакт нужно изменить: '



update_menu = '''Какое поле будем менять:
1. Фамилия 2. Имя 3. Отчество 4. Телефон 5. Комментарий'''

update_input_id = 'Подтвердите выбор контакта введя его номер позиции '

updated_info = 'Введите новую информацию: '


