menu = '''Главное меню:
1. Открыть файл журнала
2. Посмотреть журнал
3. Выбрать предмет
4. Выбрать ученика
5. Поставить оценку
6. Сохранить в файл журнала
7. Выход\n'''

input_choice = 'Выберите пункт меню: '

wrong_menu_selection = 'Вы ввели неверное число. Надо от 1 до 8'

wrong_subject_selection = 'Нет такого предмета в журнале! Выберите еще раз.'

wrong_pupil_selection = 'Нет такого ученика в журнале! Выберите еще раз.'

wrong_grade = 'Оценка должна быть от 1 до 5'

subject_selection = 'Выберите предмет: '

pupil_selection = 'Выберите ученика: '

subject_list_header = 'Список всех предметов: '

pupils_list_header = 'Список учеников: '

current_pupil = 'У доски сейчас отвечает: '
current_subject = 'Выбран предмет: '

grade = 'Оценка ученика: '


